Emacs.org
#+title: Emacs configuration
#+author: Ingvarr
#+auto_tangle: t
#+property: header-args:emacs-lisp :tangle init.el

* Content :TOC:
- [[#early-init][Early Init]]
  - [[#setup-up-basics][Setup up basics]]
  - [[#dont-blind-me-plz][Don't blind me plz]]
  - [[#garbage-collections][Garbage Collections]]
  - [[#fullscreen-start][Fullscreen Start]]
- [[#main-settings][Main Settings]]
  - [[#startup-performance][Startup Performance]]
  - [[#base][Base]]
  - [[#reload-init-file][Reload init-file]]
  - [[#coding-system][Coding system]]
  - [[#smooth-scrolling][Smooth scrolling]]
  - [[#basic-gui-setting][Basic gui setting]]
  - [[#turn-on-line-numbers][Turn on Line Numbers]]
  - [[#turn-off-line-numbers][Turn off Line Numbers]]
  - [[#transparency][Transparency]]
  - [[#load-secrets][Load Secrets]]
- [[#package-manager][Package manager]]
  - [[#straight][Straight]]
  - [[#use-package][Use-package]]
- [[#base-packages][Base Packages]]
  - [[#async][Async]]
  - [[#ibuffer][iBuffer]]
  - [[#autorevert][Autorevert]]
  - [[#dired][Dired]]
  - [[#savehistory][SaveHistory]]
  - [[#recent-files][Recent Files]]
  - [[#keeping-emacsd-clean][Keeping =~/.emacs.d/= clean]]
  - [[#undu-fu][Undu-fu]]
  - [[#project][Project]]
- [[#completion][Completion]]
  - [[#buffer-via-vertico][Buffer via Vertico]]
- [[#helpfull][Helpfull]]
- [[#keyboard][Keyboard]]
  - [[#general][General]]
  - [[#evil][Evil]]
  - [[#which-keys][Which keys]]
- [[#gui][GUI]]
  - [[#fonts][Fonts]]
  - [[#icons][Icons]]
  - [[#themes][Themes]]
  - [[#modeline][Modeline]]
  - [[#dashboard][Dashboard]]
- [[#org][Org]]
  - [[#visual-fill][Visual fill]]
  - [[#org-mode][Org-mode]]
  - [[#org-bullets][Org-bullets]]
  - [[#org-superbulets][Org-superbulets]]
  - [[#org-auto-tangle][Org-auto-tangle]]
  - [[#org-cliplink][Org-cliplink]]
  - [[#org-modern][Org-modern]]
  - [[#org-fancy-priorities][Org-fancy-priorities]]
  - [[#org-wild-notifier][Org-wild-notifier]]
  - [[#org-toc][Org-TOC]]
- [[#markdown][Markdown]]
  - [[#markdown-1][Markdown]]
  - [[#markdown-preview][Markdown-preview]]
- [[#prog-mode][Prog-mode]]
  - [[#corfu][Corfu]]
  - [[#cape][Cape]]
  - [[#kind-icon][Kind-icon]]
  - [[#yasnippet][Yasnippet]]
  - [[#yasnippet-snippets][Yasnippet-snippets]]
  - [[#yastemplate][Yastemplate]]
  - [[#smartparens][Smartparens]]
  - [[#expend-region][Expend region]]
  - [[#multiple-cursorse][Multiple Cursorse]]
  - [[#rainbow][Rainbow]]
  - [[#rainbow-delimiters][Rainbow Delimiters]]
  - [[#persp][Persp]]
- [[#magit][Magit]]
- [[#term][Term]]
- [[#other][Other]]
  - [[#pass][Pass]]

* Early Init
** Setup up basics

#+begin_src emacs-lisp :tangle ./early-init.el
  ;; -*- lexical-binding: t; -*-
  ;;Setting up locale
  (setq system-time-locale "ru_RU")
  ;;Turn off bild-on package manager "package.el"
  (setq package-enable-at-startup nil)
#+end_src

** Don't blind me plz

#+begin_src emacs-lisp :tangle ./early-init.el
  ;; Set background to mode darker
  (add-to-list 'default-frame-alist '(foreground-color . "#ebdbb2"))
  (add-to-list 'default-frame-alist '(background-color . "#282828")) 
  (setq frame-background-mode 'dark)
#+end_src

** Garbage Collections

#+begin_src emacs-lisp :tangle ./early-init.el
  ;; Garbage Collections
  (setq gc-cons-percentage 0.6)
#+end_src

** Fullscreen Start

#+begin_src emacs-lisp :tangle ./early-init.el
  ;; Starting in a fullscreen mode
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

* Main Settings
** Startup Performance

#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
  ;; Startup Performance
  ;; The default is 800 kilobytes.  Measured in bytes.
  (defun ingvarr/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'ingvarr/display-startup-time)
#+end_src

** Base

#+begin_src emacs-lisp
  ;; Settings
  (setq-default
   ad-redefinition-action 'accept                   ; Silence warnings for redefinition
   auto-save-list-file-prefix nil                   ; Prevent tracking for auto-saves
   create-lockfiles nil                             ; Locks are more nuisance than blessing
   cursor-in-non-selected-windows t                 ; Hide the cursor in inactive windows
   cursor-type '(box . 2)                           ; Underline-shaped cursor
   custom-unlispify-menu-entries nil                ; Prefer kebab-case for titles
   custom-unlispify-tag-names nil                   ; Prefer kebab-case for symbols
   delete-by-moving-to-trash t                      ; Delete files to trash
   fill-column 80                                   ; Set width for automatic line breaks
   help-window-select t                             ; Focus new help windows when opened
   indent-tabs-mode nil                             ; Stop using tabs to indent
   inhibit-startup-screen t                         ; Disable start-up screen
   initial-scratch-message ""                       ; Empty the initial *scratch* buffer
   initial-major-mode #'org-mode                    ; Prefer `org-mode' for *scratch*
   mouse-yank-at-point t                            ; Yank at point rather than pointer
   native-comp-async-report-warnings-errors 'silent ; Skip error buffers
   kill-ring-max 128                                ; Maximum length of kill ring
   load-prefer-newer t                              ; Prefer the newest version of a file
   mark-ring-max 128                                ; Maximum length of mark ring
   read-process-output-max (* 1024 1024)            ; Increase read size for data chunks
   recenter-positions '(5 bottom)                   ; Set re-centering positions
   select-enable-clipboard t                        ; Merge system's and Emacs' clipboard
   sentence-end-double-space nil                    ; Use a single space after dots
   show-help-function nil                           ; Disable help text everywhere
   tab-always-indent 'complete                      ; Indent first then try completions
   tab-width 4                                      ; Smaller width for tab characters
   use-short-answers t                              ; Replace yes/no prompts with y/n
   window-combination-resize t                      ; Resize windows proportionally
   x-stretch-cursor nil                             ; Stretch cursor to the glyph width
   vc-follow-symlinks t                             ; Always follow the symlinks
   view-read-only t)                                ; Always open read-only buffers in view-mode
  (blink-cursor-mode 0)                             ; Prefer a still cursor
  (delete-selection-mode 1)                         ; Replace region when inserting text
#+end_src

** Reload init-file

#+begin_src emacs-lisp
(defun reload-init-file ()
  (interactive)
  (load-file user-init-file))
#+end_src

** Coding system

#+BEGIN_SRC emacs-lisp
  (set-language-environment "UTF-8")
  (prefer-coding-system       'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8)
#+END_SRC

** Smooth scrolling

#+begin_src emacs-lisp
  ;; Smoother scrolling. Stolen from
  ;; https://www.reddit.com/r/emacs/comments/fwmqc8/how_to_stop_emacs_from_half_scrolling_from_bottom/fmpc2k1
  (setq scroll-margin 1               ;; Add a margin when scrolling vertically
        scroll-conservatively 101     ;; Avoid recentering when scrolling far
        scroll-up-aggressively 0.01
        scroll-down-aggressively 0.01
        scroll-preserve-screen-position t
        auto-window-vscroll nil)
#+end_src

** Basic gui setting

#+begin_src emacs-lisp
  ;;Turn off all crap
  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room
  (menu-bar-mode -1)          ; Disable the menu bar
  (setq visible-bell t)       ; Set up the visible bell
#+end_src

** Turn on Line Numbers

#+begin_src emacs-lisp
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (global-hl-line-mode t)
  (setq display-line-numbers-type 'relative)
#+end_src

** Turn off Line Numbers

Отключение нумерации строк в режимах *Org, Eshell, Term, Treemacs*

#+begin_src emacs-lisp
  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Transparency

#+begin_src emacs-lisp
  ;; Make frame transparency overridable
  (defvar ingvarr/frame-transparency '(90 . 90))
  ;; Set frame transparency
  (set-frame-parameter (selected-frame) 'alpha ingvarr/frame-transparency)
  (add-to-list 'default-frame-alist `(alpha . ,ingvarr/frame-transparency))
#+end_src

** Load Secrets

#+begin_src emacs-lisp
  (defun load-if-exists (f)
    (if (file-exists-p (expand-file-name f))
        (load-file (expand-file-name f))))

  (load-if-exists "~/.emacs.d/secrets.el.gpg")   
  ;; (load-if-exists "~/.emacs.d/secrets.el")

  ;; (load-library "~/.emacs.d/secrets.el.gpg")
#+end_src

* Package manager
** Straight

#+begin_src emacs-lisp
  ;;Straight as package manager
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

** Use-package

#+begin_src emacs-lisp
  ;; use use-package
  (straight-use-package 'use-package)
  ;; automatically ensure every package exists (like :ensure or :straight)
  (setq straight-use-package-by-default t)
#+end_src

* Base Packages
** Async

#+begin_src emacs-lisp
  ;; ASYNC
  ;; Emacs look SIGNIFICANTLY less often which is a good thing.
  ;; asynchronous bytecode compilation and various other actions makes
  (use-package async
    :defer t
    :init
    (dired-async-mode 1)
    (async-bytecomp-package-mode 1)
    :custom (async-bytecomp-allowed-packages '(all)))
#+end_src

** iBuffer

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (setq ibuffer-saved-filter-groups
        (quote (("default"
                 ("dired" (mode . dired-mode))
                 ("org" (name . "^.*org$"))
                 ("magit" (mode . magit-mode))
                 ("Mastodon" (mode . mastodon-mode))
                 ("IRC" (or (mode . circe-channel-mode) (mode . circe-server-mode)))
                 ("web" (or (mode . web-mode) (mode . js2-mode)))
                 ("shell" (or (mode . eshell-mode) (mode . shell-mode)))
                 ("mu4e" (or
                          (mode . mu4e-compose-mode)
                          (name . "\*mu4e\*")
                          ))
                 ("programming" (or
                                 (mode . clojure-mode)
                                 (mode . clojurescript-mode)
                                 (mode . python-mode)
                                 (mode . c++-mode)))
                 ("emacs" (or
                           (name . "^\\*scratch\\*$")
                           (name . "^\\*Messages\\*$")))
                 ))))

  (add-hook 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-auto-mode 1)
              (ibuffer-switch-to-saved-filter-groups "default")))

  (setq ibuffer-show-empty-filter-groups nil   ;; Don't show filter groups if there are no buffers in that group
        ibuffer-expert t   ;; Don't ask for confirmation to delete marked buffers
        uniquify-buffer-name-style 'forward ; Uniquify buffer names
        uniquify-separator "/"
        uniquify-after-kill-buffer-p t    ; rename after killing uniquified
        uniquify-ignore-buffers-re "^\\*") ; don't muck with special buffers
#+end_src

** Autorevert

#+begin_src emacs-lisp
  (use-package autorevert
    :ensure nil
    :delight auto-revert-mode
    :bind ("C-x R" . revert-buffer)
    :custom (auto-revert-verbose nil)
    :config (global-auto-revert-mode))
#+end_src

** Dired

#+begin_src emacs-lisp
  (use-package dired
    :straight nil
    :after evil evil-collection
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (setq dired-kill-when-opening-new-dired-buffer t)
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))


  (use-package dired-single
    :commands (dired dired-jump))


  (use-package dired-open
    :commands (dired dired-jump)
    :config
    ;; Doesn't work as expected!
    (add-to-list 'dired-open-functions #'dired-open-xdg t)
    (setq dired-open-extensions '(("png" . "feh")
                                  ("mkv" . "mpv"))))

  (use-package dired-subtree
    :after dired
    :bind (:map dired-mode-map
                ("<tab>" . dired-subtree-toggle)))

  (use-package dired-hide-dotfiles
    :after evil evil-collection
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
#+end_src

** SaveHistory

#+begin_src emacs-lisp
  (use-package savehist
    :defer 2
    :config
    (setq history-length 25)
    (savehist-mode 1))
#+end_src

** Recent Files

#+begin_src emacs-lisp
  ;; (use-package recentf
  ;;   :straight nil
  ;;   :disabled t
  ;;   :bind ("C-x C-r" . recentf-open-files)
  ;;   :init (recentf-mode)
  ;;   :custom
  ;;   (recentf-exclude (list "/scp:"
  ;;                          "/ssh:"
  ;;                          "/sudo:"
  ;;                          "/tmp/"
  ;;                          "~$"
  ;;                          "COMMIT_EDITMSG"))
  ;;   (recentf-max-menu-items 15)
  ;;   (recentf-max-saved-items 200)
  ;;   (recentf-save-file "~/.cache/emacs/recentf")
  ;;     ;; Save recent files every 5 minutes to manage abnormal output.
  ;;   :config (run-at-time nil (* 5 60) 'recentf-save-list))
#+end_src

** Keeping =~/.emacs.d/= clean
*** No-littering

#+begin_src emacs-lisp
  (setq no-littering-etc-directory (expand-file-name "config/" user-emacs-directory))
  (setq no-littering-var-directory (expand-file-name "data/" user-emacs-directory))
  (use-package no-littering)
  ;; (setq auto-save-file-name-transforms `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

*** Recent files

#+begin_src emacs-lisp
  ;;  (add-to-list 'recentf-exclude      
  ;;             (recentf-expand-file-name no-littering-var-directory))
  ;;  (add-to-list 'recentf-exclude
  ;;               (recentf-expand-file-name no-littering-etc-directory))
#+end_src

